In [2]:
import pandas as pd

In [5]:
student_data = [[1,15],[2,11],[3,11],[4,20]]

In [8]:
columns = ['student_id','age']

In [11]:
students = pd.DataFrame(data=student_data, columns=columns)

In [14]:
students

   student_id  age
0           1   15
1           2   11
2           3   11
3           4   20

In [17]:
rows = len(students)

In [19]:
rows

4

In [22]:
print(f"The students dataset has {rows} rows")

The students dataset has 4 rows

In [25]:
student_columns = len(students.columns)

In [28]:
print(f"The students dataset has {student_columns} columns")

The students dataset has 2 columns

In [31]:
students.head(3)

   student_id  age
0           1   15
1           2   11
2           3   11

In [33]:
students.tail(2)

   student_id  age
2           3   11
3           4   20

In [37]:
students [0:3]

   student_id  age
0           1   15
1           2   11
2           3   11

In [39]:
students.sample(3)

   student_id  age
3           4   20
0           1   15
1           2   11